---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.GetLoadIds
source: html/2b5171dd-45be-b19d-6980-2a0bc5a90398.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.GetLoadIds Method

Gets Equipment Load ids in the LoadSet.

## Syntax (C#)
```csharp
public ISet<ElementId> GetLoadIds()
```

## Returns
The Equipment Load ids.